/* Напишете програма, която приема от клавиатурата броя на банкноти 
от 1, 2, 5 лева и отпечатва възможните комбинации 
на банкноти за зададената от клавиатурата сума.*/

#include<iostream>
using namespace std;

int B1, B2, B5, P,Sum=0;

int main() {
	system("chcp 1251");
	cout << "Въведете банкноти по 1 лев: "; cin >> B1;
	cout << "Въведете банкноти по 2 лева: "; cin >> B2;
	cout << "Въведете банкноти по 5 лева: "; cin >> B5;
	cout << "Въведете желаната сума: "; cin >> P;
	for (int i = 0; i <= B1; i++)
		for (int j = 0; j <= B2; j++)
			for (int k = 0; k <= B5; k++)
				if (i * 1 + j * 2 + k * 5 == P) 
						cout << i << ", " << j << ", " << k << " - " <<  " Възможна комбинация.\n";
	system("pause");
	return 0;
}